#+TITLE: Katta Potter
#+PROPERTY: header-args :comments org

** Run tests

#+BEGIN_SRC sh :tangle no :results both verbatim
  npm test || :
#+END_SRC

#+RESULTS:
#+begin_example

> potter@1.0.0 test /home/auclair/code/kata/potter
> mocha --compilers js:babel-core/register



  ✓ One copy of any of the five books costs 8 EUR
  ✓ Two different books get a 5% discount
  ✓ Three different books get a 10% discount
  ✓ Four different books get a 20% discount
  ✓ Five different books get a 25% discount
  ✓ Four books with three different titles get a 10% discount on three + 8EUR

  6 passing (38ms)

#+end_example
